{
  "https://example.com": {
    "summary": "Summary:\n\nThis domain is an example domain used for documentation purposes. \n\nKey information:\n- Purpose: Documentation examples\n- Permission: No permission required\n- Warning: Avoid using in operations",
    "timestamp": 1763845299.0763369,
    "original_length": 142,
    "summary_length": 202
  },
  "https://timesofindia.indiatimes.com/city/mumbai/mumbai-fire-breaks-out-in-borivli-no-one-injured/articleshow/125510035.cms": {
    "summary": "A fire broke out at Ganpat Patil Nagar in Borivli, Mumbai, on November 22, 2025, at 5:29 pm. The blaze, covering 500 x 150 sq ft across 8-10 galas, was confined to electric wiring, wooden furniture, and other materials. The fire was brought under control and extinguished by 8:40 pm, with no reported injuries.",
    "timestamp": 1763848350.7356074,
    "original_length": 11796,
    "summary_length": 310
  },
  "https://mu.ac.in/old/examination.html": {
    "summary": "Here's a summary of the content:\n\n* Examination forms for Winter 2025 (SH 2025) and Summer 2025 (FH 2025) exams are available.\n* Circulars have been issued for the implementation of NEP-2020 Examination and Evaluation Guidelines for UG Programs (Arts, Science, Commerce & Management) Semesters I to II.\n* The Centre for Distance & Online Education (CDOE) examinations have been rescheduled.\n* UG NEP (Semester I-KT) and UG NEP (Semester II-Regular) examinations will be held as per revised dates.\n* The statement of the balance stock of blank OSM cum bar-coded answer books of 32 page & 8 page (Pink Colour) and stationary is available.\n* The dates for issue and return of examination forms for various courses are mentioned.\n* The dates for the distribution and collection of examination materials, such as question papers and answer sheets, are also mentioned.\n* The last dates for submission of examination forms for various courses are December 4, 2024, for the winter session and February 2025 for the summer session.\n* The University of Mumbai has issued various circulars and notifications regarding the examination process, evaluation guidelines, and other important dates.",
    "timestamp": 1764269038.3736541,
    "original_length": 74223,
    "summary_length": 1181
  },
  "https://timesofindia.indiatimes.com/india/karnataka-cm-tussle-cong-high-command-cracks-whip-sidda-invites-dks-for-breakfast-meet/articleshow/125640900.cms": {
    "summary": "Karnataka CM tussle: Congress high command intervenes. Key points:\n\n- November 28, 2025: Karnataka Chief Minister Siddaramaiah invites Deputy CM D.K. Shivakumar for breakfast at the direction of the party high command.\n- The meeting is aimed at discussing the \"power tussle\" over the chief ministerial post, which has been ongoing since the Congress government reached its halfway mark.\n- The party high command has asked Siddaramaiah and Shivakumar to meet, with both leaders stating they will obey the command.\n- This comes amid a tug-of-war between Siddaramaiah and DKS over the CM post, with DKS's faction reportedly pushing for a leadership transition.\n- The Congress government completed 2.5 years in power, prompting speculation about a leadership change.\n- DKS claimed there was a \"confidential understanding on leadership transition\" among top leaders after the 2023 elections.",
    "timestamp": 1764355457.0057466,
    "original_length": 15141,
    "summary_length": 886
  },
  "https://www.hindustantimes.com/india-news/cyclone-ditwah-when-will-the-storm-make-landfall-imd-issues-update-5-states-on-alert-101764304106310.html": {
    "summary": "Cyclone Ditwah is moving north-northwest over Sri Lanka and the Bay of Bengal. Key updates include:\n\n- The storm is expected to approach Tamil Nadu and south Andhra Pradesh by November 30.\n- As of November 28, 5:30 am IST, the storm was positioned at 8.2 degrees North, 81.1 degrees East, roughly 50 km south-southwest of Trincomalee.\n- The storm is advancing at a speed of 7 kmph.\n- The system is expected to trigger heavy to very heavy rain across southern India from November 28 to December 2.\n- Five states are on alert, with Tamil Nadu, south Andhra Pradesh, Puducherry, and four districts of Tamil Nadu under a red alert.",
    "timestamp": 1764367851.447145,
    "original_length": 8785,
    "summary_length": 627
  },
  "https://www.thehindu.com/news/national/karnataka/siddaramaiah-dk-shivakumar-to-meet-on-november-29/article70335783.ece": {
    "summary": "Key entities: \n- Siddaramaiah (Karnataka Chief Minister)\n- D.K. Shivakumar (Karnataka Deputy Chief Minister)\n- The Congress (Indian National Congress)\n- BJP (Bharatiya Janata Party)\n- JD(S) (Janaadhipathya Janata Paksha)\n- Karnataka\n- Belagavi\n\nImportant dates:\n- November 28, 2025\n- November 29, 2025 (breakfast meeting between Siddaramaiah and Shivakumar)\n- December 1, 2025 (Winter Session of Parliament begins)\n- December 8, 2025 (Winter Session of State legislature session in Belagavi)\n\nSummary:\nSiddaramaiah and D.K. Shivakumar, leaders involved in a leadership battle within the Congress party, have agreed to a breakfast meeting on November 29. This comes after the high command instructed them to hold a meeting to control damage to the party and government ahead of the State legislature session. The meeting aims to send a message to rival parties (BJP and JD(S)) that the ruling dispensation is stable.",
    "timestamp": 1764382816.298445,
    "original_length": 3532,
    "summary_length": 915
  },
  "https://indianexpress.com/article/explained/explained-sci-tech/telecom-scindia-sanchar-saathi-optional-key-concerns-10397728/": {
    "summary": "Here's a summary of the web content in under 300 words:\n\nThe Sanchar Saathi app is a cybersecurity application developed by the Indian government to help users report fraudulent calls, messages, and stolen mobile phones. The Department of Telecommunications (DoT) directed Indian smartphone companies to pre-install the app on all new devices sold in India. Initially, the DoT said users couldn't delete the app, but Telecom Minister Jyotiraditya Scindia later clarified that it's optional and users can delete the app if they want to.\n\nThe DoT's directive sparked criticism over privacy and surveillance issues, with some calling it a state-mandated software that users can't control or remove. Digital rights group Internet Freedom Foundation expressed concerns that the app will require system-level access, eroding protections that prevent one app from accessing data from others.\n\nKey facts:\n\n- The Sanchar Saathi app is a government-developed cybersecurity application.\n- The DoT directed Indian smartphone companies to pre-install the app on all new devices sold in India.\n- The initial directive said users couldn't delete the app, but it's now optional.\n- Telecom Minister Jyotiraditya Scindia clarified that users can delete the app if they want to.\n- The DoT directed a software update with the app to be issued to already-sold phones.\n- The directive was issued on November 28, 2025, under the Telecommunication Cybersecurity Amendment Rules, 2025.\n\nKey entities:\n\n- Sanchar Saathi app\n- Department of Telecommunications (DoT)\n- Telecom Minister Jyotiraditya Scindia\n- Internet Freedom Foundation\n- Indian government\n- Indian smartphone companies",
    "timestamp": 1764778060.525718,
    "original_length": 15015,
    "summary_length": 1658
  },
  "https://timesofindia.indiatimes.com/education/news/colleges-and-schools-in-chennai-to-remain-closed-thursday-as-heavy-rain-continues-due-to-cyclone-ditwah/articleshow/125746406.cms": {
    "summary": "Chennai and Tiruvallur districts in India have announced the closure of all colleges and schools on Thursday, December 03, 2025, due to heavy rain caused by Cyclone Ditwah. The India Meteorological Department (IMD) has forecast continued very heavy rain across Chennai, Tiruvallur, Chengalpattu, and Kancheepuram districts until early afternoon. The University of Madras has postponed exams scheduled for Wednesday due to the heavy rainfall. Residents have been advised to exercise caution as low-lying areas face water stagnation. The city corporation is working to drain water from residential localities using pumps to reduce flooding and maintain road accessibility. Interior regions such as Villupuram, Cuddalore, and Tiruvannamalai have also experienced heavy rain with short intervals of relief.",
    "timestamp": 1764785056.2173474,
    "original_length": 14303,
    "summary_length": 802
  },
  "https://timesofindia.indiatimes.com/india/putins-two-day-visit-advanced-brahmos-missiles-hypersonic-systems-on-table-india-russia-to-enhance-defence-ties/articleshow/125745764.cms": {
    "summary": "Key points from President Putin's two-day visit to India:\n\n* Date: December 3, 2025\n* Purpose: To discuss advanced BrahMos missile development and enhance defence ties\n* Topics:\n\t+ Joint development of advanced BrahMos variants, including BrahMos-NG\n\t+ Extended-range BrahMos systems with a range of over 400 km\n\t+ Next-generation hypersonic and long-range air-to-air missile systems\n* Context: Recent success of BrahMos in Operation Sindoor against Pakistan\n* Partners: India and Russia, with a long-standing strategic partnership\n* Outcome: Expected to enhance defence ties and deepen cooperation between the two nations\n* Key figures: Vladimir Putin, President of Russia; Narendra Modi, Prime Minister of India",
    "timestamp": 1764789129.9136262,
    "original_length": 15338,
    "summary_length": 713
  },
  "https://www.cnbc.com/2025/12/03/india-russia-putin-meeting-tariffs-new-delhi-moscow-trade.html": {
    "summary": "Here is a summary of the web content under 300 words:\n\nKey Points:\n\n- Russian President Vladimir Putin will visit India on Dec 4-5 for the 23rd India-Russia annual summit.\n- The countries aim to extend cooperation in defense and civil nuclear sectors.\n- India and Russia aim to expand bilateral trade to $100 billion by 2030 from $68.7 billion in fiscal year 2025.\n- As of fiscal year 2025, India's trade with Russia stood at $68.7 billion, heavily skewed in favor of Russia.\n- India's exports to Russia were $4.88 billion, while imports were $63.84 billion.\n- The countries are seeking to compensate for India's reduced purchases of Russian oil by increasing trade in other areas.\n- Putin's visit is significant as it indicates India's determination to maintain ties with Russia, despite being under punitive U.S. tariffs.\n- The summit is expected to issue a joint statement and sign bilateral agreements, focusing on expanding trade to achieve a more balanced bilateral trade.\n- Key areas of cooperation include machinery, chemicals, food, and pharmaceutical products exports from India and technological solutions for civilian nuclear energy from Russia.\n\nKey Entities:\n\n- Vladimir Putin (Russian President)\n- Narendra Modi (Indian Prime Minister)\n- Ian Bremmer (Eurasia Group President)\n- Chietigj Bajpaee (Chatham House Senior Research Fellow)\n- Aleksei Zakharov (Observer Research Foundation Visiting Fellow)\n- India\n- Russia\n- United States\n- China",
    "timestamp": 1764789638.4352355,
    "original_length": 6416,
    "summary_length": 1455
  },
  "https://www.indiatoday.in/india/story/world-exclusive-russian-president-putin-speaks-to-india-today-ahead-of-india-visit-2830342-2025-12-03": {
    "summary": "Russian President Vladimir Putin spoke exclusively to India Today and Aaj Tak on December 3, ahead of his two-day visit to New Delhi starting December 4. The interview, conducted by Anjana Om Kashyap and Geeta Mohan inside the Kremlin, will air on December 5 at 9 pm. Key topics discussed include US President Donald Trump, the upcoming meeting with Prime Minister Narendra Modi, and the future trajectory of India-Russia relations. Putin's comments are significant given the Russia-Ukraine conflict and the proposed US peace framework. His visit marks the first time in nearly two decades that Putin has spoken to an Indian television network. Key entities involved include:\n\n- Vladimir Putin, Russian President\n- Anjana Om Kashyap, India Today Group journalist\n- Geeta Mohan, India Today Group journalist\n- Narendra Modi, Prime Minister of India\n- Donald Trump, US President\n- US, Russia, India, and Ukraine\n\nKey dates mentioned:\n\n- December 3: Putin's interview with India Today and Aaj Tak\n- December 4: Putin's visit to New Delhi begins\n- December 5: Putin's interview to be broadcast on India Today TV",
    "timestamp": 1764795140.0666332,
    "original_length": 5646,
    "summary_length": 1107
  },
  "https://www.hindustantimes.com/world-news/russia-ukraine-war-to-finally-end-20-point-peace-plan-unveiled-in-trump-led-negotiations-101766570098882.html": {
    "summary": "Here's the summary of the web content:\n\nRussia-Ukraine war negotiations have reached a major breakthrough with Ukrainian President Volodymyr Zelensky unveiling a 20-point peace plan. The plan was agreed upon by negotiators from Kyiv and Washington and is awaiting Moscow's response. Key elements of the plan include:\n\n- Affirming Ukraine's sovereignty as a sovereign state\n- Establishing a non-aggression agreement between Russia and Ukraine\n- Creating a monitoring mechanism to oversee the line of contact\n- Ukraine receiving strong security guarantees\n- A framework for post-war reconstruction\n- Additional bilateral agreements between the US and Ukraine on security guarantees and reconstruction\n\nThe plan is intended to stop the fighting that began in February 2022. Ukraine's president, Zelensky, stated that consensus has been reached on many points, but the issue of territory remains unresolved.",
    "timestamp": 1766587613.5319753,
    "original_length": 13538,
    "summary_length": 903
  },
  "https://www.thehindu.com/news/international/switzerland-ski-resort-fire-bar-new-year-celebration-death-toll-live-updates-january-1-2026/article70460021.ece": {
    "summary": "Here is the summary of the web content:\n\nA fire broke out at the \"Le Constellation\" bar in Crans-Montana, Switzerland on January 1, 2026, during a New Year's celebration. \n- Police reported around 100 people injured, most seriously.\n- Several dozen people are presumed dead, but the exact number is premature to confirm due to ongoing identification efforts.\n- Authorities have not yet determined the cause of the fire, but it is ruled out to be an attack.\n- A no-fly zone was imposed over the area, and it is completely closed to the public.\n- At least two French citizens were among the injured.\n- The incident occurred in the Valais Canton, a popular ski resort town in southwestern Switzerland.",
    "timestamp": 1767280137.4775136,
    "original_length": 5948,
    "summary_length": 698
  },
  "https://timesofindia.indiatimes.com/business/infrastructure/vande-bharat-sleeper-to-be-launched-in-january-on-guwahati-to-kolkata-route-indian-railways-ashwini-vaishnaw-announces-route-check-details-features-of-new-train/articleshow/126284684.cms": {
    "summary": "Here is the summary of the web content:\n\n- The first Vande Bharat sleeper train is scheduled to be launched in January 2026.\n- Prime Minister Narendra Modi is expected to flag off the train in the second half of January 2026.\n- The train will run between Guwahati and Kolkata, with a planned speed of 180 kmph.\n- Each Vande Bharat sleeper train has 16 coaches, with a capacity to accommodate 823 passengers.\n- The composition of coaches is: 11 AC 3-tier, 4 AC 2-tier, and one AC 1st coach.\n- The fares of Vande Bharat sleeper train will start from Rs 2,300 for a one-way fare between Guwahati and Kolkata.\n- Eight more Vande Bharat sleeper trains will be rolled out in the next six months, with a total of 12 trains by year-end.\n- The train is scheduled to run on 1,200-1,500 kmph routes of the Indian Railways national transporter.",
    "timestamp": 1767280979.7458212,
    "original_length": 18153,
    "summary_length": 832
  },
  "https://www.euronews.com/2025/12/31/russia-sticks-to-putin-residence-attack-claims-as-allies-question-moscows-motives": {
    "summary": "Key entities: \n\n- Russia\n- President Vladimir Putin\n- Ukraine\n- EU\n- US\n- Russian Defence Ministry\n- Dmitry Peskov (Putin's spokesperson)\n- Valdai (town)\n- Moscow\n- Sergei Lavrov (Russian Foreign Minister)\n- Interfax (news agency)\n\nKey dates: \n\n- 29 December (alleged drone attack)\n- 31 December (claims by Russia)\n- 1 January 2024 (Putin's speech at his residence)\n\nKey numbers: \n\n- 89 (downed Ukrainian drones according to Russian Defence Ministry)\n- 91 (long-range drones involved in alleged attack according to Sergei Lavrov)\n\nKey events: \n\n- Alleged Ukrainian drone attack on Putin's residence\n- Release of a video by Russian Defence Ministry purporting to show a downed drone\n- Residents of Valdai deny witnessing any signs of a drone attack\n- Sergei Lavrov's statement on Moscow's negotiating stance shifting following the alleged attack",
    "timestamp": 1767281490.2398992,
    "original_length": 8022,
    "summary_length": 844
  },
  "https://timesofindia.indiatimes.com/city/gurgaon/why-no-one-heard-her-cries-dense-fog-midnight-chill-let-gang-rape-suspects-drive-freely-on-lonely-gurgaonfaridabad-road/articleshow/126282929.cms": {
    "summary": "Here is the summary of the web content:\n\n**Incident:** A 25-year-old woman was allegedly gang-raped inside a moving van on the Gurgaon-Faridabad Road on January 1, 2026.\n\n**Key Details:**\n\n- The incident occurred between midnight and 3 am, with dense fog and biting cold prevailing on the road.\n- The woman had accepted a lift in the van, unaware that two men were inside.\n- The suspects drove the woman to isolated stretches of Faridabad, holding her captive for nearly three hours.\n- The woman allegedly screamed for help during the ordeal, but her cries went unheard due to poor visibility and little traffic on the road.\n- Two van drivers from Jhansi and Mathura in Uttar Pradesh were arrested by the Sector 48 crime branch on January 2, 2026.\n- The Maruti Suzuki Eeco van allegedly used in the crime was seized by the police.\n- An identification parade is to be conducted to ensure a fair trial.",
    "timestamp": 1767282652.7200189,
    "original_length": 15001,
    "summary_length": 900
  }
}